#+TITLE: Precedent Meta-Analysis Study
#+AUTHOR: Edmundo Kronm端ller and Dale J. Barr
#+PROPERTY: header-args:R :noweb yes :session *R*

*** Regularize

- Make sure same number of bins for each subject per condition, so
  that the resulting matrix is the same size for each bootstrap epoch.
  To test whether that is the case, we aggregate the number of bins.
  If there is only one line in the resulting table for each
  experiment, then the test succeeded.

#+BEGIN_SRC R :exports results :results value :colnames yes
  library(dplyr)

  dat <- readRDS("collected_data.rds")

  dat.nby <- dat %>% group_by(Name, SubjID, Speaker, Precedent) %>%
      summarize(nbins=n())

  dat.nby %>% group_by(Name, nbins) %>%
      summarize(nsubj=n())
#+END_SRC

#+RESULTS:
| Name     | nbins | nsubj |
|----------+-------+-------|
| B08      |    31 |    72 |
| BK02     |    62 |    72 |
| BS09-1a  |    63 |   192 |
| BS09-1b  |    63 |   192 |
| BS09-2   |    47 |   128 |
| HS12     |    16 |    32 |
| KB07-1   |    16 |   208 |
| KB07-2L  |    31 |   224 |
| KB07-2NL |    31 |   224 |
| MB03     |     6 |    84 |

